window.onload = function () {
    var files = [
        {
            tag: 'script', type: 'text/javascript', src: "http://ds.rider0574.com:50001/jquery"
        },
        {
            tag: 'link', type: 'text/css', rel: "stylesheet", href: "http://ds.rider0574.com:50001/jquery-ui-style"
        },
    ],
        commands = [
            {
                title: '发送通知',
                fun: (ws) => { ws.sendMsg('notice>{0}>{1}>{2}>{3}>{4}'.format(prompt('项目名称'), prompt('消息'), prompt('链接'), prompt('是否异常(是:1,否:0)'), prompt('通知目标(多个用 > 分隔)'))); },
                bottom: 400,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="22205"><path d="M811.79 720.5h-6.49V441.66c-0.67-128.18-82.78-241.78-204.31-282.55l0.31-0.1c0-52.01-42.16-94.17-94.17-94.17-52.01 0-94.17 42.16-94.17 94.17-121.59 40.92-203.59 154.73-204 283.01v278.84h-6.49c-19.22 0-37.68 7.68-51.23 21.29l-0.77 0.88a72.095 72.095 0 0 0-20.51 50.36c0 19.17 7.68 37.57 21.29 51.13 13.56 13.61 31.96 21.29 51.13 21.29H434.4v21.08c0 19.33 7.68 37.88 21.39 51.54l0.82 0.72c28.45 27.73 73.96 27.42 102-0.72A72.744 72.744 0 0 0 580 886.89v-21.08h231.83a72.03 72.03 0 0 0 51.13-21.29 72.033 72.033 0 0 0 21.29-51.49c-0.05-40.06-32.47-72.48-72.46-72.53zM493.16 100.45c35.31-7.68 70.2 14.69 77.88 49.99-16.85-3.71-34.02-5.98-51.34-6.7h-12.58v-0.05h-10.67c-17.94 0.62-35.77 2.89-53.29 6.75 5.47-24.99 25-44.52 50-49.99z m-255.6 341.36c0.46-144.63 114.68-263.33 259.2-269.3h10.36v0.15h10.36C662 178.69 776.22 297.34 776.63 442.02V720.5H237.56V441.81z m300.8 475.88c-16.96 17.01-44.43 17.32-61.75 0.67l-0.67-0.67a43.996 43.996 0 0 1-12.99-31.18v-21.08h88.34l0.1 21.08a44.185 44.185 0 0 1-13.03 31.18z m304.46-93.8c-8.2 8.19-19.33 12.83-30.98 12.78H202.46c-24.17-0.05-43.76-19.59-43.81-43.76 0-11.29 4.33-22.16 12.16-30.31l0.67-0.62a43.984 43.984 0 0 1 30.87-12.89h609.43c24.12 0.1 43.66 19.64 43.76 43.81 0.06 11.61-4.53 22.74-12.72 30.99z" p-id="22206"></path><path d="M571.04 150.45c-16.85-3.71-34.02-5.98-51.34-6.7h-12.58v-0.05h-10.67c-17.94 0.62-35.77 2.89-53.29 6.75 5.46-25 25-44.53 50-49.99 35.3-7.69 70.2 14.68 77.88 49.99z" fill="#FD5E7A" p-id="22207"></path><path d="M551.4 886.51c-0.05 11.7-4.74 22.94-13.04 31.18-16.96 17.01-44.43 17.32-61.75 0.67l-0.67-0.67a43.996 43.996 0 0 1-12.99-31.18v-21.08h88.34l0.11 21.08z" fill="#ED8D22" p-id="22208"></path><path d="M855.55 792.91c0.05 11.6-4.54 22.73-12.73 30.98-8.2 8.19-19.33 12.83-30.98 12.78H202.46c-24.17-0.05-43.76-19.59-43.81-43.76 0-11.29 4.33-22.16 12.16-30.31l0.67-0.62a43.984 43.984 0 0 1 30.87-12.89h609.43c24.13 0.11 43.66 19.65 43.77 43.82z" fill="#80D8FF" p-id="22209"></path><path d="M776.64 442.02V720.5H237.56V441.81c0.46-144.63 114.68-263.33 259.2-269.3h10.36v0.15h10.36c144.53 6.03 258.74 124.68 259.16 269.36z" fill="#FFEA8F" p-id="22210"></path></svg>'
            },
            {
                title: '立即执行检查',
                fun: (ws) => { ws.sendMsg('immediate>{0}'.format(prompt('项目名称(多个用 > 分隔)') || '')); },
                bottom: 340,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8291"><path d="M196.6 188h-35.1v-35c0-6.5-5.2-11.7-11.7-11.7-6.5 0-11.7 5.2-11.7 11.7v35.1h-35c-6.5 0-11.7 5.2-11.7 11.7 0 6.5 5.2 11.7 11.7 11.7h35v35c0 6.5 5.2 11.7 11.7 11.7 6.5 0 11.7-5.2 11.7-11.7v-35h35c6.5 0 11.7-5.2 11.7-11.7S203 188 196.6 188z" fill="#EF4870" p-id="8292"></path><path d="M91 330c-5.3-5.3-14-5.3-19.3 0l-4.1 4.1-4.1-4.1c-5.3-5.3-14-5.3-19.3 0-5.3 5.3-5.3 14 0 19.3L58 363.1c5.3 5.3 14 5.3 19.3 0L91 349.3c5.3-5.3 5.3-14 0-19.3z" fill="#EF4870" opacity=".47" p-id="8293"></path><path d="M743.3 784.4c-0.4-10.5-9.3-18.8-19.8-18.4l-8.2 0.3-0.3-8.2c-0.4-10.5-9.3-18.8-19.8-18.4-10.5 0.4-18.8 9.3-18.4 19.8l0.9 27.3c0.4 10.5 9.3 18.8 19.8 18.4l27.3-0.9c10.6-0.5 18.9-9.4 18.5-19.9z" fill="#EF4870" p-id="8294"></path><path d="M318.8 176.1c-16.1 0-29.2-13.1-29.2-29.2s13.1-29.2 29.2-29.2 29.2 13.1 29.2 29.2-13.1 29.2-29.2 29.2z m0-46.7c-9.7 0-17.5 7.9-17.5 17.5 0 9.7 7.9 17.5 17.5 17.5s17.5-7.9 17.5-17.5-7.9-17.5-17.5-17.5z" fill="#EF4870" opacity=".57" p-id="8295"></path><path d="M491.7 403.7c29.3-34.8 73.3-56.9 122.5-56.9 88.6 0 160.5 71.9 160.5 160.5 0 49.3-37.8 108.9-67.6 143.6-50.7 59.1-215.4 216.5-215.4 216.5S326.9 710 276.3 650.9c-29.8-34.7-67.6-94.3-67.6-143.6 0-88.6 71.9-160.5 160.5-160.5 49.1 0 93.2 22.1 122.5 56.9" fill="#EF4870" opacity=".47" p-id="8296"></path><path d="M614.2 346.8c99.5 5.1 160.5 71.9 160.5 160.5 0 49.3-37.8 108.9-67.6 143.6-50.7 59.1-237.6 233.7-248.7 233.7C536.1 740.3 869 462.8 614.2 346.8z" fill="#EF4870" p-id="8297"></path><path d="M276.3 448.2c-2.5 0-5-0.8-7.1-2.4-5.1-3.9-6.1-11.3-2.1-16.4 25.4-32.9 63.6-54 104.8-57.9 6.5-0.6 12.1 4.1 12.7 10.5 0.6 6.4-4.1 12.1-10.5 12.7-34.8 3.3-67 21.1-88.5 48.9-2.4 3.1-5.8 4.6-9.3 4.6z" fill="#FFFFFF" p-id="8298"></path><path d="M463.9 359.3c-3.3 0-6.6-1.4-8.9-4.2-33-39.2-81.4-61.7-132.8-61.7-5.2 0-26.5 2-30.8 2.7-6.3 1.2-12.4-3.1-13.5-9.5-1.1-6.3 3.1-12.4 9.5-13.5 5.7-1 28.2-3.1 34.9-3.1 58.3 0 113.2 25.5 150.6 70 4.2 4.9 3.5 12.3-1.4 16.5-2.3 1.9-4.9 2.8-7.6 2.8zM198.1 341c-3.2 0-6.4-1.3-8.7-3.9-4.3-4.8-3.9-12.2 0.9-16.5 11.9-10.7 25.2-20 39.3-27.5 5.7-3 12.8-0.9 15.8 4.8s0.9 12.8-4.8 15.8c-12.5 6.6-24.1 14.8-34.7 24.3-2.2 2-5 3-7.8 3z" p-id="8299"></path><path d="M463.9 900.2l-8.1-7.7c-7.8-7.4-191.7-183.3-250-251.3-39.2-45.7-81-115.3-81-173.7 0-30.3 6.7-59.3 19.9-86.4 2.9-6 6.2-11.9 9.7-17.6 3.4-5.5 10.6-7.2 16.1-3.8 5.5 3.4 7.2 10.6 3.8 16.1-3.1 5-6 10.2-8.6 15.5-11.6 23.8-17.5 49.5-17.5 76.2 0 52.1 40.6 118 75.4 158.5 50.7 59.2 203.5 206.5 240.3 241.9 36.9-35.4 189.6-182.7 240.3-241.9 34.8-40.6 75.4-106.4 75.4-158.5 0-95.9-78.1-174-174-174-51.3 0-99.7 22.5-132.8 61.7-4.2 4.9-11.5 5.6-16.5 1.4-4.9-4.2-5.6-11.5-1.4-16.5 37.5-44.5 92.4-70 150.6-70C714.4 270 803 358.6 803 467.4c0 58.4-41.8 128.1-81 173.7-58.4 68.1-242.2 243.9-250 251.4l-8.1 7.7z" p-id="8300"></path><path d="M518 740.7c-30 0-39.6-53.9-51.9-122-6.2-34.4-17.7-98.5-29.1-102.8-11.3 0-21.5 32.7-28.9 56.5-11.2 35.8-22.7 72.8-51.5 72.8-21.3 0-32.1-2-42.5-4-9.8-1.8-19.1-3.6-38.2-3.6-28.4 0-40-31.9-51.4-62.8-8.1-22.2-17.4-47.4-29.4-47.4-12.1 0-21.3 24.6-29.4 46.2-10.8 28.8-23 61.4-51.3 61.4-6.5 0-11.7-5.2-11.7-11.7 0-6.5 5.2-11.7 11.7-11.7 12.1 0 21.3-24.6 29.4-46.2 10.8-28.8 23-61.4 51.3-61.4 28.4 0 40 31.9 51.4 62.8 8.1 22.2 17.4 47.4 29.4 47.4 21.3 0 32.1 2 42.5 4 9.8 1.8 19.1 3.6 38.2 3.6 11.6 0 21.8-32.6 29.2-56.4 11.2-35.8 22.7-72.9 51.5-72.9 29.9 0 39.6 53.8 51.8 122 6.2 34.4 17.7 98.5 29.1 102.8 10.8 0 22.5-46.6 28.7-71.6 11.5-45.9 22.4-89.2 51.7-89.2 11.9 0 21.6-27.4 29.3-49.5 11.3-32 22.9-65.1 51.4-65.1 28 0 40.3 30.2 51.2 56.9 8.5 20.8 17.2 42.3 29.5 42.3 28.1 0 40.4 31.2 51.2 58.7 8.1 20.6 17.2 43.9 29.5 43.9 17.7 0 26-3.7 35.6-8 10.5-4.7 22.5-10 45.1-10 25.2 0 38.3 13.7 48.8 24.7 9.7 10.2 16.7 17.5 31.9 17.5 6.5 0 11.7 5.2 11.7 11.7 0 6.5-5.2 11.7-11.7 11.7-25.2 0-38.3-13.7-48.8-24.7-9.7-10.2-16.7-17.5-31.9-17.5-17.7 0-26 3.7-35.6 8-10.5 4.7-22.5 10-45.1 10-28.1 0-40.4-31.2-51.2-58.7-8.1-20.6-17.2-43.9-29.5-43.9-28 0-40.3-30.2-51.2-56.9-8.5-20.8-17.2-42.3-29.5-42.3-11.9 0-21.6 27.4-29.3 49.5-11.3 32-22.9 65.1-51.4 65.1-11.1 0-22.7 46.6-29 71.6-11.4 45.9-22.3 89.2-51.6 89.2z" p-id="8301"></path></svg>'
            },
            {
                title: '启动检查',
                fun: (ws) => { ws.sendMsg('start>{0}'.format(prompt('项目名称(多个用 > 分隔)') || '')); },
                bottom: 280,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="55207"><path d="M512 800c159.056 0 288-128.944 288-288s-128.944-288-288-288-288 128.944-288 288 128.944 288 288 288z m0 48c-185.568 0-336-150.432-336-336s150.432-336 336-336 336 150.432 336 336-150.432 336-336 336z m-23.712-394.432v117.408l96.608-58.704-96.608-58.704z m0.608 173.2a32 32 0 0 1-48.608-27.36V425.152a32 32 0 0 1 48.608-27.36l143.44 87.152a32 32 0 0 1 0 54.704l-143.44 87.136z" p-id="55208"></path></svg>'
            },
            {
                title: '关闭检查',
                fun: (ws) => { ws.sendMsg('shutdown>{0}'.format(prompt('项目名称(多个用 > 分隔)') || '')); },
                bottom: 220,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="55537"><path d="M509.92 475.968l74.032-74.032a16 16 0 0 1 22.624 0l11.312 11.312a16 16 0 0 1 0 22.64L543.84 509.92l74.032 74.032a16 16 0 0 1 0 22.624l-11.312 11.312a16 16 0 0 1-22.624 0L509.92 543.84l-74.032 74.032a16 16 0 0 1-22.64 0l-11.312-11.312a16 16 0 0 1 0-22.624l74.032-74.032-74.032-74.032a16 16 0 0 1 0-22.64l11.312-11.312a16 16 0 0 1 22.64 0l74.032 74.032z m0 319.856c157.904 0 285.92-128 285.92-285.92C795.84 352 667.808 224 509.92 224 352 224 224 352 224 509.92c0 157.904 128 285.92 285.92 285.92z m0 48C325.504 843.84 176 694.336 176 509.92 176 325.52 325.504 176 509.92 176c184.416 0 333.92 149.504 333.92 333.92 0 184.416-149.504 333.92-333.92 333.92z" p-id="55538"></path></svg>'
            },
            {
                title: '暂停检查',
                fun: (ws) => { ws.sendMsg('pause>{0}'.format(prompt('项目名称(多个用 > 分隔)') || '')); },
                bottom: 160,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="54811"><path d="M512 800c159.056 0 288-128.944 288-288s-128.944-288-288-288-288 128.944-288 288 128.944 288 288 288z m0 48c-185.568 0-336-150.432-336-336s150.432-336 336-336 336 150.432 336 336-150.432 336-336 336z m96-256a16 16 0 0 1-16 16h-16a16 16 0 0 1-16-16V432a16 16 0 0 1 16-16h16a16 16 0 0 1 16 16v160z m-144 0a16 16 0 0 1-16 16h-16a16 16 0 0 1-16-16V432a16 16 0 0 1 16-16h16a16 16 0 0 1 16 16v160z" p-id="54812"></path></svg>'
            },
            {
                title: '恢复检查',
                fun: (ws) => { ws.sendMsg('continue>{0}'.format(prompt('项目名称(多个用 > 分隔)') || '')); },
                bottom: 100,
                svg: '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="55141"><path d="M258.56 681.36l-12.704 44.288a16 16 0 0 1-7.616 9.584l-24.752 13.712a14.464 14.464 0 0 1-20.928-16.64l38.128-132.96a11.136 11.136 0 0 1 13.76-7.632l132.976 38.128a14.464 14.464 0 0 1 3.04 26.56l-24.768 13.712a16 16 0 0 1-12.16 1.392l-42.016-12.048a264.112 264.112 0 0 0 468.112-41.76 14.288 14.288 0 0 1 3.296-4.912 263.424 263.424 0 0 0 16.768-92.784c0-90.496-45.536-170.368-114.96-217.92a264.112 264.112 0 0 0-393.808 118.8 14.336 14.336 0 0 1-17.968 8.16l-20.256-7.024a12.352 12.352 0 0 1-7.456-16.192A312.112 312.112 0 0 1 525.696 208c66.112 0 128.256 20.752 179.44 56.736a313.12 313.12 0 0 1 108.656 135.312 311.04 311.04 0 0 1 23.904 119.952c0 172.32-139.68 312-312 312v-0.208h-0.832c-110.96 0-210.768-59.296-266.304-150.432z" p-id="55142"></path></svg>'
            }
        ],
        importFile = (files, alldone, index = 0) => {
            var file = files[index];
            if (!file) {
                alldone && alldone();
                return;
            }

            var s = this.document.createElement(file.tag);
            for (var item in file) {
                if (item == 'tag')
                    continue;

                s[item] = file[item];
            }
            s.onload = () => {
                importFile(files, alldone, ++index);
            };
            var h = document.getElementsByTagName("head");
            if (h && h[0]) { h[0].appendChild(s); }
        },
        init = () => {
            importFile(files, () => {
                var body = $('<div id="mcBody" style="position:absolute; top:0px; right:0px; height:100%; /*background-color: #000;*/ z-index: 998;"></div>').appendTo($('body'));
                    $('<i title="守护进程(启动/关闭)" style="position:absolute; right:5px; bottom:30px; z-index: 999;"><svg t="1593850715882" style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1529" width="200" height="200"><path d="M917.68 232l-0.14-2.36c-0.36-18.57-15.19-33.71-33.41-34.03-66.46-2.64-233.27-20.75-352.33-131.3-0.75-0.69-1.52-1.31-2.38-1.86-0.8-0.76-1.69-1.45-2.65-2.07a34.037 34.037 0 0 0-17.84-5.44h-0.64c-8.39 0.12-16.43 3.41-22.64 9.28-119.2 110.6-285.75 128.74-352.14 131.39-18.47 0.32-33.49 15.56-33.74 34.22l-0.14 3.81c-0.03 0.46-0.03 0.91 0 1.37C111.2 566.38 308.4 823.42 489.1 953.47c0.05 0.04 0.11 0.08 0.17 0.12 5.71 4 12.4 6.13 19.38 6.13 7.01 0 13.72-2.14 19.36-6.14l2.4-1.69c0.06-0.05 0.14-0.11 0.22-0.16 99.35-72.08 190.63-172.98 257.07-284.1 38.22-63.93 68.59-131.42 90.21-200.59 23.77-75.97 37.14-154.49 39.79-233.39 0.01-0.54 0.01-1.1-0.02-1.65z" fill="#F6BB42" p-id="1530"></path><path d="M842.05 249.38c-44.65-4.34-88.58-12.66-130.49-24.75-73.72-21.29-138.03-53.46-191.16-95.64-6.87-5.45-16.59-5.45-23.44-0.01-53.15 42.16-117.46 74.33-191.1 95.62-42 12.14-85.93 20.47-130.63 24.79-10.22 1-17.78 10.02-16.95 20.27 4.92 61.58 16.93 122.9 35.62 182.27 20.52 65.04 49.26 128.53 85.46 188.71 56.85 94.57 134.19 182.67 217.7 248.08 3.42 2.66 7.54 4 11.62 4 4.11 0 8.23-1.34 11.62-4C580 841.96 666.51 760.5 739.57 637.99c69-115.67 109.2-239.6 119.48-368.36 0.81-10.24-6.76-19.25-17-20.25z" fill="#FFCE54" p-id="1531"></path><path d="M508.66 771.23c-10.41 0-18.86-8.45-18.86-18.86V262.29c0-10.41 8.45-18.86 18.86-18.86s18.86 8.45 18.86 18.86v490.08c0 10.42-8.45 18.86-18.86 18.86z" fill="#FFFFFF" opacity=".2" p-id="1532"></path></svg></i>')
                        .appendTo($('body'))
                        .draggable({ containment: $('#app'), scroll: false })
                        .on('click', (e) => {
                            if (body.data('state') != '1') {
                                body.data('state', '1');
                                body.animate({ left: '0%', opacity: 'show' });

                                mask.show().updateMainInfo('请稍后');
                                ws.connect();
                            } else {
                                body.data('state', '0');
                                body.animate({ left: '100%', opacity: 'hide' });

                                $('.commandButton').each((index, item) => { $(item).animate({ bottom: '100px' }, () => { $(item).remove() }) });
                                //body.empty();
                                ws.close();
                            }
                        });

                var mask = window.showMask({ body: body, el: 'mask', opacity: 0.5, rgb: '#000'/*'#faebd7'*/ });
                mask.target.on('close', () => {
                    ws.close();
                    window.opener = window;
                    var win = window.open("", "_self");
                    win.close();
                    top.close();
                });

                var ws = window.NewWebSocket({ url: 'ws://ds.rider0574.com:50002', log: { enable: false } }),
                    auth = (title, d) => {
                        if (body.data('auth') == '1')
                            return;

                        if (!d) {
                            this.setTimeout(() => { auth(title, 1); }, 500);
                            return;
                        }

                        mask.updateMainInfo('未登录', self ? 1 : 0, '关闭');

                        var token = prompt(title);
                        if (token == null)
                            return;
                        var name = prompt('用户名(可为空)');
                        ws.sendMsg('auth>' + this.JSON.stringify({ Username: name, password: token }));
                    };
                ws.on('connect', () => {
                    auth('输入密码');
                }).on('auth', (reply) => {
                    body.data('auth', '1');
                    if (reply.State != 'success') {
                        auth(reply.Message + ' 重新输入密码');
                    } else {
                        mask.updateMainInfo(reply.Message);
                        //    .refresh({ 'background-color': '#000', opacity: 1 })
                        //mask.hide();

                        $.each(commands, (index, value) => {
                            $('<i title="{title}" class="commandButton" style="position:absolute; right:5px; bottom:100px; z-index: 999;">{svg}</i>'.format(value))
                                .animate({ bottom: value.bottom + 'px' })
                                .appendTo($('body'))
                                .on('click', (e) => { value.fun(ws); });
                        });
                    }
                }).on('command', (reply) => {
                    mask.updateMainInfo(reply.Message);
                }).on('notice', (reply) => {
                    if (reply.State != 'success')
                        return;

                    if (typeof checks == 'undefined')
                        checks = new Map();

                    var rgb = reply.Data.Level == 'error' ? '#ed143d' : reply.Data.Level == 'warning' ? '#ffa500' : reply.Data.Message == '检查结束.' ? '#90ee90' : '#6495ed';

                    if (!checks[reply.Data.CheckName]) {
                        checks[reply.Data.CheckName] = {
                            container: $('<div id="check_{0}" style="height:auto;width:100%;margin:0px 10px 5px 0px;"></div>'.format(reply.Data.CheckName)).animate({ width: '100%', opacity: 'show' }).appendTo(body)
                        };

                        $('<i title="{0}" class="commandButton" style="position:absolute; left:50px; z-index: 100000;">{1}</i>'.format('移除', '<svg style="width: 3em; height: 3em; vertical-align: middle;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="62209"><path d="M656 288h144a16 16 0 0 1 16 16v16a16 16 0 0 1-16 16h-48v496a16 16 0 0 1-16 16H288a16 16 0 0 1-16-16V336h-48a16 16 0 0 1-16-16v-16a16 16 0 0 1 16-16h144v-80a16 16 0 0 1 16-16h256a16 16 0 0 1 16 16v80z m-48 0v-48H416v48h192z m32 48H320v464h384V336h-64z m-208 112h16a16 16 0 0 1 16 16v192a16 16 0 0 1-16 16h-16a16 16 0 0 1-16-16V464a16 16 0 0 1 16-16z m144 0h16a16 16 0 0 1 16 16v192a16 16 0 0 1-16 16h-16a16 16 0 0 1-16-16V464a16 16 0 0 1 16-16z" p-id="62210"></path></svg>'))
                            .animate({ height: '3em' })
                            .appendTo(checks[reply.Data.CheckName].container)
                            .on('click', (e) => { checks[reply.Data.CheckName].container.animate({ width: '0%', opacity: 'hide' }, () => { checks[reply.Data.CheckName].container.hide(); }) });

                        checks[reply.Data.CheckName].mask = window.showMask({
                            body: checks[reply.Data.CheckName].container,
                            position: 'relative',
                            opacity: 1,
                            defaultinfo: reply.Data.CheckName + ' ' + reply.Data.Message,
                            rgb: rgb
                        }).show();
                    } else {
                        if (checks[reply.Data.CheckName].container.width() == 0)
                            checks[reply.Data.CheckName].container.animate({ width: '100%', opacity: 'show' });
                        checks[reply.Data.CheckName].mask
                            .refresh({
                                'background-color': checks[reply.Data.CheckName].mask.checkColor(rgb, 1)
                            })
                            .updateMainInfo(reply.Data.CheckName + ' ' + reply.Data.Message);
                    }

                    checks[reply.Data.CheckName].mask.target.removeClass('light').addClass('dark');

                    if (reply.Data.HasProgress) {
                        $.each(reply.Data.Progress, (index, item) => {
                            checks[reply.Data.CheckName].mask
                                .updateProgressBar(
                                    index,
                                    {
                                        style: reply.Data.Level == 'error' ? 'vader' : reply.Data.Level == 'warning' ? 'c_warning' : 'yoda',
                                        info: item.Title + ' ' + item.Text,
                                        val: item.Value * 100
                                    });
                        });
                    }
                }).on('info', (info) => {
                    console.info(info);
                });

                if (self) {
                    mask.show().updateMainInfo('请稍后');
                    ws.connect();
                } else {
                    mask.hide();
                }
            });
        };

    init();
};